Tekla Open API Reference for Tekla Structures 2025
AnalysisLoadGroup.GetTypeName Method
 Get load group type name, translated to current language.
 Namespace: Tekla.Structures.Analysis
 Assembly: Tekla.Structures.Analysis (in Tekla.Structures.Analysis.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public static string GetTypeName(
	AnalysisLoadGroup.LoadGroupTypeEnum type
)
Public Shared Function GetTypeName (
	type As AnalysisLoadGroup.LoadGroupTypeEnum
) As String
Parameters
type
Type: Tekla.Structures.Analysis.AnalysisLoadGroup.LoadGroupTypeEnum
Load group type.
Return Value
Type: String
The load group type name, translated to current language.
See Also
Reference
AnalysisLoadGroup Class
Tekla.Structures.Analysis Namespace